PRAGMA foreign_keys = ON;

-- PDFに記載のサンプルデータ（抜粋）を投入

INSERT INTO "会員" ("会員番号", "氏名", "性別", "年齢") VALUES
  (101, '中央太郎', '男', 49),
  (102, '草野みどり', '女', 35),
  (103, '白門次郎', '男', 52),
  (104, '赤井花子', '女', 77),
  (105, '多摩三郎', '男', 23),
  (106, '森野めぐみ', '女', 38);

INSERT INTO "身体計測" ("会員番号", "身長", "体重") VALUES
  (101, 175.5, 78.5),
  (102, 158.0, 61.5),
  (103, 168.7, 73.2),
  (104, 148.6, 55.5),
  (105, 182.5, 68.9),
  (106, 164.2, 52.3);

INSERT INTO "運動強度" ("メニュー", "強度") VALUES
  ('ウォーキング', '小'),
  ('ヨガ', '小'),
  ('水中ウォーキング', '中'),
  ('ジョギング', '中'),
  ('縄跳び', '大'),
  ('スイミング', '大');

INSERT INTO "選択" ("会員番号", "メニュー") VALUES
  (101, 'ウォーキング'),
  (102, 'ヨガ'),
  (103, '水中ウォーキング'),
  (104, 'ジョギング'),
  (105, '縄跳び'),
  (106, 'スイミング');


